; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v6 - type_1 ?v1 - type_2)
 	      (pred_4 ?v5 - object ?v1 - type_2)
	      (pred_2 ?v6 - type_1 ?v8 - type_3)
	      (pred_1 ?v6 - type_1 ?v5 - object ?v8 - type_3))

   (:action op_3
       :parameters  (?v6 - type_1 ?v3 ?v4 - type_2)
       :precondition (and  (pred_3 ?v6 ?v3))
       :effect (and  (pred_3 ?v6 ?v4)
		     (not (pred_3 ?v6 ?v3))))

   (:action op_1
       :parameters (?v6 - type_1 ?v7 - object ?v2 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v7 ?v2) (pred_3 ?v6 ?v2) (pred_2 ?v6 ?v8))
       :effect (and (pred_1 ?v6 ?v7 ?v8)
		    (not (pred_4 ?v7 ?v2)) 
		    (not (pred_2 ?v6 ?v8))))

   (:action op_2
       :parameters (?v6 - type_1 ?v7 - object ?v2 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v7 ?v8) (pred_3 ?v6 ?v2))
       :effect (and (pred_4 ?v7 ?v2)
		    (pred_2 ?v6 ?v8)
		    (not (pred_1 ?v6 ?v7 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_02 obj_04 - type_1
obj_05 obj_03 obj_10 obj_09 - type_3
obj_12 obj_01 obj_07 obj_11 - type_2
obj_08 obj_06 obj_13 obj_14 - object)
(:init
(pred_3 obj_02 obj_07)
(pred_2 obj_02 obj_05)
(pred_2 obj_02 obj_03)
(pred_3 obj_04 obj_01)
(pred_2 obj_04 obj_10)
(pred_2 obj_04 obj_09)
(pred_4 obj_08 obj_01)
(pred_4 obj_06 obj_11)
(pred_4 obj_13 obj_11)
(pred_4 obj_14 obj_12)
)
(:goal
(and
(pred_4 obj_08 obj_07)
(pred_4 obj_06 obj_12)
(pred_4 obj_13 obj_11)
(pred_4 obj_14 obj_11)
)
)

(:constraints
  (always (not (pred_3 obj_02 obj_11)))
)
)

; plan
1. (op_1 obj_04 obj_08 obj_01 obj_09)
   deleted: (pred_4 obj_08 obj_01) (pred_2 obj_04 obj_09)
   added: (pred_1 obj_04 obj_08 obj_09)
   goals met: 1 of 4
2. (op_3 obj_02 obj_07 obj_12)
   deleted: (pred_3 obj_02 obj_07)
   added: (pred_3 obj_02 obj_12)
   goals met: 1 of 4
3. (op_3 obj_04 obj_01 obj_07)
   deleted: (pred_3 obj_04 obj_01)
   added: (pred_3 obj_04 obj_07)
   goals met: 1 of 4
4. (op_1 obj_02 obj_14 obj_12 obj_03)
   deleted: (pred_4 obj_14 obj_12) (pred_2 obj_02 obj_03)
   added: (pred_1 obj_02 obj_14 obj_03)
   goals met: 1 of 4
5. (op_2 obj_04 obj_08 obj_07 obj_09)
   deleted: (pred_1 obj_04 obj_08 obj_09)
   added: (pred_4 obj_08 obj_07) (pred_2 obj_04 obj_09)
   goals met: 2 of 4
6. (op_2 obj_02 obj_14 obj_12 obj_03)
   deleted: (pred_1 obj_02 obj_14 obj_03)
   added: (pred_4 obj_14 obj_12) (pred_2 obj_02 obj_03)
   goals met: 2 of 4
7. (op_3 obj_04 obj_07 obj_11)
   deleted: (pred_3 obj_04 obj_07)
   added: (pred_3 obj_04 obj_11)
   goals met: 2 of 4
8. (op_1 obj_04 obj_06 obj_11 obj_09)
   deleted: (pred_4 obj_06 obj_11) (pred_2 obj_04 obj_09)
   added: (pred_1 obj_04 obj_06 obj_09)
   goals met: 2 of 4
9. (op_3 obj_04 obj_11 obj_12)
   deleted: (pred_3 obj_04 obj_11)
   added: (pred_3 obj_04 obj_12)
   goals met: 2 of 4
10. (op_2 obj_04 obj_06 obj_12 obj_09)
   deleted: (pred_1 obj_04 obj_06 obj_09)
   added: (pred_4 obj_06 obj_12) (pred_2 obj_04 obj_09)
   goals met: 3 of 4
11. (op_1 obj_04 obj_14 obj_12 obj_09)
   deleted: (pred_4 obj_14 obj_12) (pred_2 obj_04 obj_09)
   added: (pred_1 obj_04 obj_14 obj_09)
   goals met: 3 of 4
12. (op_3 obj_04 obj_12 obj_11)
   deleted: (pred_3 obj_04 obj_12)
   added: (pred_3 obj_04 obj_11)
   goals met: 3 of 4
13. (op_2 obj_04 obj_14 obj_11 obj_09)
   deleted: (pred_1 obj_04 obj_14 obj_09)
   added: (pred_4 obj_14 obj_11) (pred_2 obj_04 obj_09)
   goals met: 4 of 4
